# Data Wrangle: CX Data + Orders vs. Product Data

####  Import Customers dataframe
#### Check update column types and names in customer dataframe
#### Conduct consistency checks on customer dataframe
####  Check for duplicates
#### Combine Orders_Products with Customers Dataframe
#### 5. Export Customers Data to Pickle File

In [1]:
# Import Libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

# 1. Import Customers Dataframe

In [2]:
# Import Data

path = r'/Users/ladyarmanoid/Documents/Data Analytics/CareerFoundry/Course/2- Data Immersion/Achievement 4/Instacart Basket Analysis/'

df_cx = pd.read_csv(os.path.join(path,'02 Data','Original Data','customers.csv'), index_col = False)

In [3]:
# Data Types

df_cx.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [4]:
df_cx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [5]:
df_cx.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
df_cx.shape

(206209, 10)

In [7]:
df_cx.columns

Index(['user_id', 'First Name', 'Surnam', 'Gender', 'STATE', 'Age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

# 4. Wrangle the data so that it follows consistent logic

In [8]:
#### Rename Columns

df_cx.rename(columns={"n_dependants":"dependants", "First Name":"first_name", "Surnam":"last_name", "Gender":"gender", "STATE":"state",
                            "Age":"age"}, inplace=True)

#### Check Output
df_cx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   user_id      206209 non-null  int64
 1   first_name   194950 non-null  object
 2   last_name    206209 non-null  object
 3   gender       206209 non-null  object
 4   state        206209 non-null  object
 5   age          206209 non-null  int64
 6   date_joined  206209 non-null  object
 7   dependants   206209 non-null  int64
 8   fam_status   206209 non-null  object
 9   income       206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [9]:
df_cx.describe()

             user_id            age     dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [10]:
#### Update 'user_id' = str + 'date_joined' = datetime

df_cx['user_id'] = df_cx['user_id'].astype('str')
df_cx['date_joined'] = pd.to_datetime(df_cx['date_joined'])

# Check Output

df_cx.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   user_id      206209 non-null  object
 1   first_name   194950 non-null  object
 2   last_name    206209 non-null  object
 3   gender       206209 non-null  object
 4   state        206209 non-null  object
 5   age          206209 non-null  int64
 6   date_joined  206209 non-null  datetime64[ns]
 7   dependants   206209 non-null  int64
 8   fam_status   206209 non-null  object
 9   income       206209 non-null  int64
dtypes: datetime64[ns](1), int64(3), object(6)
memory usage: 15.7+ MB

In [11]:
# Function to check mixed-type columns

for col in df_cx.columns.tolist():
    weird = (df_cx[[col]].map(type) != df_cx[[col]].iloc[0].apply(type)).any(axis = 1)    
    if len (df_cx[weird]) > 0:
        print (col)

first_name

In [12]:
# Update 'first_name' = str

df_cx['first_name'] = df_cx['first_name'].astype('str')

#### Summary

Because the original column "First Name" had mixed types, the string value was assigned to the renamed column "first_name"

# 5. Quality and Consistency Checks

In [13]:
# Check columns with any missing values

df_cx.columns[df_cx.isnull().any()]

Index([], dtype='object')

In [14]:
# Check 'first_name' column with any missing values

df_cx['first_name'].isnull()

0         False
1         False
2         False
3         False
4         False
          ...
206204    False
206205    False
206206    False
206207    False
206208    False
Name: first_name, Length: 206209, dtype: bool

In [15]:
# Check 'income' column with any missing values

df_cx['income'].value_counts(dropna = False)

income
57192     10
95891     10
95710     10
97532      9
98675      9
          ..
73141      1
71524      1
74408      1
44780      1
148828     1
Name: count, Length: 108012, dtype: int64

#### Summary

There are no missing values in 'income'

In [16]:
# Drop column ‘date_joined'

df_cx = df_cx.drop(columns = ['date_joined'])

#### Check other columns' consistency (values)

In [17]:
# Check 'gender' -> type and counts

df_cx['gender'].value_counts(dropna = False)

gender
Male      104067
Female    102142
Name: count, dtype: int64

In [18]:
# Check 'state' -> unique values

df_cx['state'].nunique()

51

In [19]:
# Check 'state' -> names

df_cx['state'].value_counts(dropna = False)

state
Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: count, dtype: int64

#### Summary

There is a count of 51 states: 50 states + 1 federal district "District of Columbia"

In [20]:
# Check 'age'

df_cx['age'].describe()

count    206209.000000
mean         49.501646
std          18.480962
min          18.000000
25%          33.000000
50%          49.000000
75%          66.000000
max          81.000000
Name: age, dtype: float64

In [21]:
# Check for any null values or odd ages

df_cx['age'].value_counts()

age
19    3329
55    3317
51    3317
56    3306
32    3305
      ...
65    3145
25    3127
66    3114
50    3102
36    3101
Name: count, Length: 64, dtype: int64

#### Summary

There are no odd nor missing values

In [22]:
# Check 'fam_status' -> type and counts

df_cx['fam_status'].value_counts(dropna = False)

fam_status
married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: count, dtype: int64

In [24]:
# Check for duplicates in df_cx

df_dups = df_cx[df_cx.duplicated()]

# Check Output

df_dups.shape

(0, 9)

#### Summary

There are no duplicates

# 6. Combine Customers Data with the Orders_Products Datatframe

In [25]:
# Import ords_prods_merge

ords_prods_merge = pd.read_pickle(os.path.join(path,'02 Data','Prepared Data','ords_prods_aggregated.pkl'))

In [26]:
ords_prods_merge.shape

(32404859, 24)

In [27]:
# Drop column '_merge'

ords_prods_merge = ords_prods_merge.drop(columns = ['_merge'])

# Check Output

ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 23 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   number_of_orders        int64
 3   orders_day_of_week      int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
 6   product_id              float64
 7   add_to_cart_order       float64
 8   reordered               float64
 9   product_name            object
 10  aisle_id                int64
 11  department_id           int64
 12  prices                  float64
 13  price_range_loc         object
 14  busiest_day             object
 15  busiest_days            object
 16  busiest_period_of_day   object
 17  max_order               int64
 18  loyalty_flag            object
 19  average_spend           float64
 20  spender_flag            object
 21  customer_frequency      float64
 22  frequency_flag          object
dtypes: float64(7), int64(8), object(8)
memory usage: 5.6+ GB

In [32]:
#### Update 'user_id' = INT

df_cx['user_id'] = df_cx['user_id'].astype('int')

In [33]:
# Merge 'ords_prods_merge' with 'customers' using user_id

ords_prods_cx_merge = ords_prods_merge.merge(df_cx, on = ['user_id'], indicator = True)

In [34]:
# Check the output

ords_prods_cx_merge.head()

,order_id,user_id,number_of_orders,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,frequency_flag,first_name,last_name,gender,state,age,dependants,fam_status,income,_merge
0,2539329,1,1,2,8,NaN,196.0,1.0,0.0,Soda,...,non_frequent_customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
1,2398795,1,2,3,7,15.0,196.0,1.0,1.0,Soda,...,non_frequent_customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
2,473747,1,3,3,12,21.0,196.0,1.0,1.0,Soda,...,non_frequent_customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
3,2254736,1,4,4,7,29.0,196.0,1.0,1.0,Soda,...,non_frequent_customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
4,431534,1,5,4,15,28.0,196.0,1.0,1.0,Soda,...,non_frequent_customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both

In [35]:
ords_prods_cx_merge['_merge'].value_counts(dropna = False)

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [36]:
ords_prods_cx_merge.shape

(32404859, 32)

In [37]:
ords_prods_cx_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 32 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   number_of_orders        int64
 3   orders_day_of_week      int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
 6   product_id              float64
 7   add_to_cart_order       float64
 8   reordered               float64
 9   product_name            object
 10  aisle_id                int64
 11  department_id           int64
 12  prices                  float64
 13  price_range_loc         object
 14  busiest_day             object
 15  busiest_days            object
 16  busiest_period_of_day   object
 17  max_order               int64
 18  loyalty_flag            object
 19  average_spend           float64
 20  spender_flag            object
 21  customer_frequency      float64
 22  frequency_flag          object
 23  first_name              object
 24  last_name               object
 25  gender                  object
 26  state                   object
 27  age                     int64
 28  dependants              int64
 29  fam_status              object
 30  income                  int64
 31  _merge                  category
dtypes: category(1), float64(7), int64(11), object(13)
memory usage: 7.5+ GB

In [38]:
# Drop newly created '_merge' column

ords_prods_cx_merge = ords_prods_cx_merge.drop(columns = ['_merge'])

# Check Output

ords_prods_cx_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 31 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   number_of_orders        int64
 3   orders_day_of_week      int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
 6   product_id              float64
 7   add_to_cart_order       float64
 8   reordered               float64
 9   product_name            object
 10  aisle_id                int64
 11  department_id           int64
 12  prices                  float64
 13  price_range_loc         object
 14  busiest_day             object
 15  busiest_days            object
 16  busiest_period_of_day   object
 17  max_order               int64
 18  loyalty_flag            object
 19  average_spend           float64
 20  spender_flag            object
 21  customer_frequency      float64
 22  frequency_flag          object
 23  first_name              object
 24  last_name               object
 25  gender                  object
 26  state                   object
 27  age                     int64
 28  dependants              int64
 29  fam_status              object
 30  income                  int64
dtypes: float64(7), int64(11), object(13)
memory usage: 7.5+ GB

# 8. Export 'ords_prods_cx_merge' using PKL

In [39]:
ords_prods_cx_merge.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_cx_merge.pkl'))